// Увімкнути/вимкнути FLS (Full Logging System) (в роботі)
window['FLS'] = false;

// Підключення основного файлу стилів
import '../scss/style.scss';

// ========================================================================================================================================================================================================================================================
// Функціонал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsFunctions from './files/functions.js';

/* Модуль для роботи з меню (Бургер) */
flsFunctions.menuInit();

// Налаштування підключення плагіна слайдера Swiper та нових слайдерів виконується у файлі js/files/sliders.js
import './files/sliders.js';

//Зміна дизайну скроллбару
import './files/scroll/simplebar.js';

// Спостерігач за об'єктами з атрибутом data-watch
import './libs/watcher.js';

// Функції роботи скролом
import * as flsScroll from './files/scroll/scroll.js';

// Плавна навігація по сторінці
flsScroll.pageNavigation();

// Функціонал додавання класів до хедеру під час прокручування
flsScroll.headerScroll();

// Галерея
import './files/gallery.js';

// Підключаємо файли зі своїм кодом
import './files/script.js';
